Continued from previous comment.
<details><summary>Show Output</summary>

```diff
fter apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-3.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-3.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint_route_table_association.dynamodb_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint_route_table_association.dynamodb_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint_route_table_association.dynamodb_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint_route_table_association.dynamodb_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint_route_table_association.s3_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint_route_table_association.s3_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint_route_table_association.s3_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_eu-west-3.aws_vpc_endpoint_route_table_association.s3_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_egress_only_internet_gateway.eigw will be created
  + resource "aws_egress_only_internet_gateway" "eigw" {
      + id     = (known after apply)
      + vpc_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_network_interface.nat[0] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.208.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.sa-east-1a.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_sa-east-1.aws_network_interface.nat[1] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.210.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.sa-east-1b.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_sa-east-1.aws_network_interface.nat[2] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.212.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.sa-east-1c.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_sa-east-1.aws_route.eigw[0] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route.eigw[1] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route.eigw[2] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route.igw6 will be created
  + resource "aws_route" "igw6" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route.nat[0] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route.nat[1] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route.nat[2] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table.dmz will be created
  + resource "aws_route_table" "dmz" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dmz.sa-east-1.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table.lan[0] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.sa-east-1a.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table.lan[1] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.sa-east-1b.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table.lan[2] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.sa-east-1c.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table_association.dmz[0] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table_association.dmz[1] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table_association.dmz[2] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table_association.lan[0] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table_association.lan[1] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_route_table_association.lan[2] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_subnet.dmz[0] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "sa-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.208.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.sa-east-1a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_subnet.dmz[1] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "sa-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.210.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.sa-east-1b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_subnet.dmz[2] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "sa-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.212.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.sa-east-1c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_subnet.lan[0] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "sa-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.208.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.sa-east-1a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_subnet.lan[1] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "sa-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.210.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.sa-east-1b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_subnet.lan[2] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "sa-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.212.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.sa-east-1c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "10.60.208.0/20"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "sa-east-1.int.jlyo.net"
        }
    }

  # module.aws_region_sa-east-1.aws_vpc_dhcp_options.dhcp will be created
  + resource "aws_vpc_dhcp_options" "dhcp" {
      + domain_name         = "int.jlyo.net"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_dhcp_options_association.dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.sa-east-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.sa-east-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint_route_table_association.dynamodb_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint_route_table_association.s3_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint_route_table_association.s3_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint_route_table_association.s3_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_sa-east-1.aws_vpc_endpoint_route_table_association.s3_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_us-east-1.aws_egress_only_internet_gateway.eigw will be created
  + resource "aws_egress_only_internet_gateway" "eigw" {
      + id     = (known after apply)
      + vpc_id = (known after apply)
    }

  # module.aws_region_us-east-1.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.aws_region_us-east-1.aws_network_interface.nat[0] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.0.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.us-east-1a.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_us-east-1.aws_network_interface.nat[1] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.2.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.us-east-1b.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_us-east-1.aws_network_interface.nat[2] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.4.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.us-east-1c.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_us-east-1.aws_network_interface.nat[3] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.6.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.us-east-1d.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_us-east-1.aws_network_interface.nat[4] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.8.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.us-east-1e.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_us-east-1.aws_network_interface.nat[5] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.10.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.us-east-1f.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_us-east-1.aws_route.eigw[0] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.eigw[1] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.eigw[2] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.eigw[3] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.eigw[4] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.eigw[5] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.igw6 will be created
  + resource "aws_route" "igw6" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.nat[0] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.nat[1] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.nat[2] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.nat[3] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.nat[4] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route.nat[5] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table.dmz will be created
  + resource "aws_route_table" "dmz" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dmz.us-east-1.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table.lan[0] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.us-east-1a.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table.lan[1] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.us-east-1b.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table.lan[2] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.us-east-1c.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table.lan[3] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.us-east-1d.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table.lan[4] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.us-east-1e.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table.lan[5] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.us-east-1f.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.dmz[0] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.dmz[1] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.dmz[2] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.dmz[3] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.dmz[4] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.dmz[5] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.lan[0] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.lan[1] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.lan[2] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.lan[3] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.lan[4] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_route_table_association.lan[5] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.dmz[0] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.0.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.us-east-1a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.dmz[1] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.2.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.us-east-1b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.dmz[2] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.4.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.us-east-1c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.dmz[3] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.6.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.us-east-1d.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.dmz[4] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1e"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.8.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.us-east-1e.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.dmz[5] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1f"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.10.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.us-east-1f.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.lan[0] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.0.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.us-east-1a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.lan[1] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.2.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.us-east-1b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.lan[2] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.4.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.us-east-1c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.lan[3] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.6.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.us-east-1d.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.lan[4] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1e"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.8.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.us-east-1e.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_subnet.lan[5] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "us-east-1f"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.10.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.us-east-1f.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "10.60.0.0/20"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "us-east-1.int.jlyo.net"
        }
    }

  # module.aws_region_us-east-1.aws_vpc_dhcp_options.dhcp will be created
  + resource "aws_vpc_dhcp_options" "dhcp" {
      + domain_name         = "int.jlyo.net"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
    }

  # module.aws_region_us-east-1.aws_vpc_dhcp_options_association.dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.aws_region_us-east-1.aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_us-east-1.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_us-east-1.aws_vpc_endpoint_route_table_association.dynamodb_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_us-east-1.aws_vpc_endpoint_route_table
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.